[
  {
    "image": "https://i.ibb.co.com/SD8hHDYR/demo-app-6.webp",
    "title": "Daily Planner: Organize your day, achieve more ",
    "companyName": "Productive Labs ",
    "id": 1,
    "description": "Daily Planner is designed to help you make the most of every day by organizing your schedule with clarity and ease. Whether you’re juggling meetings, personal errands, or creative projects, the app keeps all your plans neatly arranged in one intuitive interface. With color-coded categories and quick task entry, managing your time feels effortless and motivating.\n\nThe smart reminder system ensures you never miss a deadline or appointment. You can set daily goals, track progress, and even analyze your productivity trends over time. Integration with your calendar and to-do lists allows seamless coordination between work and personal life.\n\nDaily Planner also supports habit tracking, helping you build consistency and focus on long-term improvement. Whether you’re a student, entrepreneur, or professional, this app adapts to your lifestyle and helps you stay balanced, focused, and on top of your priorities every single day.",
    "size": "45 MB",
    "reviews": "2.3K",
    "ratingAvg": 4.6,
    "downloads": "9M",
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 210 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 650 },
      { "name": "5 star", "count": 920 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/d4rYW0wL/unnamed.png",
    "title": "FitTrack: Your personal fitness journey starts here",
    "companyName": "Wellness Inc • fittrack.io",
    "id": 2,
       "description": "FitTrack is the ultimate fitness companion for anyone looking to stay active and healthy. Whether you’re starting your fitness journey or are a seasoned athlete, FitTrack helps you track every workout, analyze your performance, and stay motivated. With real-time stats, progress tracking, and daily summaries, it transforms fitness into a fun, measurable experience.\n\nThe app syncs seamlessly with smartwatches and fitness bands to monitor your steps, calories, heart rate, and sleep cycles. It also provides personalized workout plans based on your fitness level and goals. You can log activities, join challenges, and celebrate milestones as you improve day by day.\n\nFitTrack’s nutrition tracker ensures your diet complements your training. With motivational notifications and progress insights, you’ll stay accountable and inspired. It’s not just a fitness tracker — it’s a personal trainer in your pocket, guiding you toward a stronger, healthier you.",
    "size": "58 MB",
    "reviews": "5.4K",
    "ratingAvg": 4.8,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": 230 },
      { "name": "2 star", "count": 280 },
      { "name": "3 star", "count": 370 },
      { "name": "4 star", "count": 720 },
      { "name": "5 star", "count": 3900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/F4SPyVqk/demo-app-1.webp",
    "title": "PhotoSnap: Capture moments, share memories",
    "companyName": "Pixelify ",
    "id": 3,
        "description": "PhotoSnap turns your everyday moments into stunning visual stories. It’s built for photographers, travelers, and anyone who loves capturing life’s details. With powerful filters, intuitive editing tools, and real-time effects, every shot becomes a masterpiece. The interface is simple yet elegant, designed to help you focus on creativity instead of complexity.\n\nYou can adjust lighting, contrast, and color balance, or use AI-powered enhancement to instantly improve image quality. PhotoSnap supports both photo and video editing, allowing you to craft cinematic visuals directly on your device.\n\nOnce you’ve perfected your shot, share it instantly to social media or your PhotoSnap cloud gallery. Collaborate with friends on shared albums and explore trending photography around the world. Whether you’re capturing sunsets, portraits, or street scenes, PhotoSnap brings artistry to your fingertips — wherever inspiration strikes.",
    "size": "97 MB",
    "reviews": "8.9K",
    "ratingAvg": 4.3,
    "downloads": "8M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 680 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 2400 },
      { "name": "5 star", "count": 4320 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/d4Kw5FyS/images-2.jpg",
    "title": "CodeMate: The smart coding assistant",
    "companyName": "DevTools Studio • codemate.dev",
    "id": 4,
       "description": "CodeMate empowers developers to write cleaner, smarter, and more efficient code. Whether you’re coding in JavaScript, Python, or C++, CodeMate provides real-time error detection, intelligent suggestions, and best practice recommendations. It helps you save time, avoid bugs, and focus on building great software.\n\nThe app features a lightweight, distraction-free editor that integrates with Git and major code repositories. You can collaborate with teammates in real-time, review pull requests, and deploy directly from within the app.\n\nCodeMate’s AI assistant learns your coding style and offers context-aware hints to speed up development. It even provides snippets, documentation lookup, and performance insights. Whether you’re a solo developer or part of a large team, CodeMate enhances productivity, improves quality, and transforms coding into a smooth, enjoyable experience.",
    "size": "112 MB",
    "reviews": "3.3K",
    "ratingAvg": 4.5,
    "downloads": "5M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 240 },
      { "name": "3 star", "count": 600 },
      { "name": "4 star", "count": 800 },
      { "name": "5 star", "count": 1460 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/RpGzDFQv/demo-app-4.webp",
    "title": "BudgetBuddy: Master your money effortlessly",
    "companyName": "FinSmart Ltd • budgetbuddy.com",
    "id": 5,
        "description": "BudgetBuddy is your go-to financial companion designed to make budgeting simple and stress-free. It helps you track income, monitor expenses, and set savings goals all in one easy-to-use dashboard. Whether you’re managing personal finances or planning family budgets, BudgetBuddy keeps your money organized and transparent.\n\nWith smart analytics, you’ll get insights into your spending habits and discover areas where you can save more. The app categorizes expenses automatically and creates visual charts to help you understand your financial behavior. You can also set custom alerts for bills and payment reminders, so you never miss a due date.\n\nBudgetBuddy empowers you to take control of your finances and plan for the future with confidence. With data encryption and secure syncing, your information remains private and protected. Start building financial freedom today — one smart decision at a time.",
    "size": "33 MB",
    "reviews": "2.1K",
    "ratingAvg": 4.7,
    "downloads": "7M",
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 140 },
      { "name": "3 star", "count": 200 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 1060 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/YBK0L495/a-chosen-soul-Fn-GZcsme-D2-U-unsplash.jpg",
    "title": "SoundWave: Feel the beat, live the rhythm",
    "companyName": "Beatify Audio • soundwave.app",
    "id": 6,
        "description": "SoundWave brings your favorite music closer than ever before. With millions of tracks from every genre, it’s your one-stop destination for discovering, streaming, and sharing songs. Whether you’re relaxing at home, working out, or traveling, SoundWave creates the perfect soundtrack for every moment.\n\nIts intelligent recommendation system curates playlists based on your mood and listening history. You can explore trending hits, discover new artists, and even create collaborative playlists with friends. The high-fidelity audio ensures studio-quality sound on any device.\n\nSoundWave also includes offline mode for uninterrupted listening wherever you are. With a sleek design and seamless playback, it’s not just a music app — it’s a rhythm companion that moves with you. Dive into a world of sound and let every beat tell your story.",
    "size": "82 MB",
    "reviews": "9.5K",
    "ratingAvg": 4.4,
    "downloads": "12M",
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 1400 },
      { "name": "3 star", "count": 2000 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 2600 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/273BMmn7/demo-app-2.webp",
    "title": "WeatherNow: Your local weather, anytime, anywhere",
    "companyName": "SkyVision • weathernow.io",
    "id": 7,
        "description": "SoundWave brings your favorite music closer than ever before. With millions of tracks from every genre, it’s your one-stop destination for discovering, streaming, and sharing songs. Whether you’re relaxing at home, working out, or traveling, SoundWave creates the perfect soundtrack for every moment.\n\nIts intelligent recommendation system curates playlists based on your mood and listening history. You can explore trending hits, discover new artists, and even create collaborative playlists with friends. The high-fidelity audio ensures studio-quality sound on any device.\n\nSoundWave also includes offline mode for uninterrupted listening wherever you are. With a sleek design and seamless playback, it’s not just a music app — it’s a rhythm companion that moves with you. Dive into a world of sound and let every beat tell your story.",
    "size": "24 MB",
    "reviews": "4.3K",
    "ratingAvg": 4.2,
    "downloads": "3M",
    "ratings": [
      { "name": "1 star", "count": 340 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 900 },
      { "name": "4 star", "count": 1600 },
      { "name": "5 star", "count": 1060 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/DHZnswRG/images-1.png",
    "title": "EduVerse: Learn, Explore, and Grow",
    "companyName": "LearnTech Global • eduverse.io",
    "id": 8,
      "description": "EduVerse transforms the way you learn by bringing a universe of knowledge to your fingertips. From academic subjects to creative skills, the platform offers thousands of high-quality video lessons taught by global experts. Whether you’re preparing for exams or pursuing hobbies, EduVerse empowers you to learn at your own pace.\n\nInteractive quizzes, progress tracking, and discussion forums make learning engaging and social. Students can collaborate on projects, share notes, and gain insights from instructors in real-time sessions. The app’s AI-powered recommendations tailor courses to your interests and goals, ensuring every minute you spend learning counts.\n\nEduVerse bridges the gap between curiosity and achievement. It’s more than just an education app — it’s a learning community that inspires growth, curiosity, and lifelong exploration for students and professionals alike.",
    "size": "64 MB",
    "reviews": "8K",
    "ratingAvg": 4.9,
    "downloads": "9M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 6500 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/hFF0fM8b/glenn-carstens-peters-ZWD3-Dx6a-UJg-unsplash.jpg",
    "title": "TravelGo: Your ultimate travel companion",
    "companyName": "Explore World • travelgo.com",
    "id": 9,
       "description": "TravelGo makes every journey an adventure to remember. With its all-in-one travel planning features, you can find destinations, compare flight and hotel deals, and create personalized itineraries effortlessly. The app simplifies trip organization so you can focus on experiences, not logistics.\n\nPowered by smart recommendations, TravelGo curates destinations based on your interests, travel history, and budget. Whether you crave beaches, mountains, or cityscapes, the app finds the perfect escape for you. It also provides local insights, safety tips, and real-time navigation support to make your travels seamless.\n\nFrom last-minute getaways to long-term adventures, TravelGo ensures stress-free exploration. Save your favorite spots, share travel memories, and connect with other explorers worldwide. With TravelGo, your next journey is always just a tap away.",
    "size": "55 MB",
    "reviews": "7.6K",
    "ratingAvg": 4.6,
    "downloads": "4.5M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 720 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 1800 },
      { "name": "5 star", "count": 3880 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/WWYjtqpQ/unnamed-3.png",
    "title": "NoteWise: Your smart note-taking app",
    "companyName": "SmartApps Co. • notewise.app",
    "id": 10,
      "description": "NoteWise is your intelligent note-taking assistant designed for productivity and creativity. Capture ideas instantly, jot down meeting notes, or draft essays with an interface that’s clean, fast, and distraction-free. Every note is automatically saved, synced, and categorized for easy access anytime.\n\nYou can organize content using folders, color labels, and tags. The built-in search and handwriting recognition ensure you’ll never lose an important idea again. NoteWise supports voice notes, checklists, and even image attachments for visual thinkers.\n\nWith cross-device synchronization, your notes are always available — on mobile, tablet, or desktop. Whether you’re a student, professional, or creator, NoteWise helps you turn fleeting thoughts into lasting ideas, keeping your mind and workflow perfectly aligned.",
    "size": "41 MB",
    "reviews": "3.7K",
    "ratingAvg": 4.5,
    "downloads": "2.3M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 420 },
      { "name": "3 star", "count": 600 },
      { "name": "4 star", "count": 1000 },
      { "name": "5 star", "count": 2080 }
    ]
  },
  
  {
    "image": "https://i.ibb.co.com/7NRwBgpw/6081243-d60f659719f916c896809ebb168fbe4007b91c06-large.webp",
    "title": "MindEase: Find your calm, boost your focus.",
    "companyName": "CalmTech • mindease.app",
    "id": 11,
       "description": "MindEase is your pocket companion for mental well-being. It helps you reduce stress, anxiety, and burnout through guided meditation, relaxation exercises, and mood tracking. Designed with mindfulness experts, the app makes mental wellness accessible for everyone.\n\nEach session is tailored to your needs — from short breathing breaks to deep sleep meditations. You can track mood changes, set daily mindfulness goals, and receive personalized tips for emotional resilience.\n\nWith soothing audio, nature sounds, and calming visuals, MindEase creates a space for reflection and tranquility. It’s not just an app — it’s a lifestyle companion that helps you build a peaceful, balanced, and more mindful life.",
    "size": "52 MB",
    "reviews": "6.7K",
    "ratingAvg": 4.8,
    "downloads": "6.2M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 800 },
      { "name": "4 star", "count": 1400 },
      { "name": "5 star", "count": 4300 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/zW5FFCsP/unnamed-2.png",
    "title": "CookUp: Discover recipes, cook with confidence.",
    "companyName": "KitchenHub • cookup.io",
    "id": 12,
      "description": "CookUp turns your kitchen into a world of flavor and creativity. With thousands of step-by-step recipes, it helps beginners and food lovers alike cook delicious meals at home. Whether you’re craving comfort food or experimenting with global cuisines, CookUp has something for every taste.\n\nEach recipe includes detailed instructions, cooking time, and nutritional information. You can filter by ingredients, dietary preferences, or difficulty level. The app also lets you create grocery lists, save favorites, and share your culinary creations with the community.\n\nFrom quick weekday dinners to festive feasts, CookUp inspires you to cook smarter, healthier, and happier. With CookUp, every meal becomes a new adventure.",
    "size": "68 MB",
    "reviews": "5.9K",
    "ratingAvg": 4.6,
    "downloads": "4.7M",
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 520 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 2980 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/chCHMM53/download.png",
    "title": "CryptoVault: Secure your digital assets.",
    "companyName": "FinEdge • cryptovault.io",
    "id": 13,
        "description": "CryptoVault offers a safe and smart way to manage your cryptocurrency portfolio. Whether you’re a beginner or a seasoned investor, it provides real-time tracking, analytics, and price alerts for all major coins and tokens.\n\nThe app prioritizes security with advanced encryption, biometric login, and cold-storage compatibility. You can monitor live market data, set trade alerts, and analyze your performance through easy-to-read charts.\n\nCryptoVault also delivers market news and insights to keep you updated on trends and regulations. With CryptoVault, you gain confidence in managing your digital assets — safely, efficiently, and intelligently.",
    "size": "89 MB",
    "reviews": "4.3K",
    "ratingAvg": 4.4,
    "downloads": "2.8M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 1000 },
      { "name": "5 star", "count": 1900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/tT6wzyMM/attachment-132249620.png",
    "title": "ShopSmart: Your shopping companion",
    "companyName": "RetailPro • shopsmart.io",
    "id": 14,
      "description": "ShopSmart revolutionizes your shopping experience by helping you find the best deals, discounts, and product reviews in one place. Whether you’re buying electronics, clothing, or groceries, ShopSmart ensures you always get the best value.\n\nIts built-in price comparison tool scans thousands of stores to find the lowest prices instantly. You can set alerts for product price drops and explore user reviews before making a purchase.\n\nWith a personalized dashboard and wishlist tracking, ShopSmart simplifies online shopping while maximizing savings. Spend smarter, shop faster, and enjoy every purchase with confidence.",
    "size": "39 MB",
    "reviews": "7.2K",
    "ratingAvg": 4.7,
    "downloads": "5.6M",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 1900 },
      { "name": "5 star", "count": 3900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/wZV4fyjb/latest-news-poster-banner-graphic-600nw-2453491007.webp",
    "title": "DailyNews+: Stay informed, stay ahead.",
    "companyName": "InfoNow • dailynewsplus.com",
    "id": 15,
     "description": "DailyNews+ delivers breaking news and in-depth stories from trusted sources across the globe. Whether it’s politics, science, sports, or entertainment, the app keeps you informed in real time.\n\nYou can customize your news feed to match your interests and language preferences. Its minimalist layout reduces clutter and helps you focus on what matters.\n\nWith features like offline reading, audio news, and daily summaries, DailyNews+ makes staying informed effortless. It’s not just about news — it’s about understanding the world with clarity and perspective.",
    "size": " 47 MB",
    "reviews": "6.8K",
    "ratingAvg": 4.3,
    "downloads": "7.2M",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 1800 },
      { "name": "5 star", "count": 2900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/5XYR8Hgj/images.png",
    "title": "WorkHub: Your collaborative workspace",
    "companyName": "TeamSpace • workhub.io",
    "id": 16,
       "description": "WorkHub streamlines teamwork with an all-in-one workspace for communication, project management, and file sharing. Designed for teams of all sizes, it helps you work smarter and faster from anywhere.\n\nCreate channels for projects, share updates in real time, and integrate tools like Google Drive and Trello. WorkHub keeps your team aligned and tasks organized in one place.\n\nWith video conferencing, progress tracking, and smart notifications, collaboration has never been easier. WorkHub brings people together to build ideas, solve problems, and achieve goals efficiently.",
    "size": "88 MB",
    "reviews": "10.2K",
    "ratingAvg": 4.5,
    "downloads": "8.3M",
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 2600 },
      { "name": "5 star", "count": 4900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/JRxqq72K/images.jpg",
    "title": "LangFlow: Learn new languages with interactive lessons.",
    "companyName": "GlobalTalk • langflow.io",
    "id": 17,
   "description": "LangFlow makes language learning exciting and practical. Whether you’re learning English, Spanish, or Japanese, it helps you build vocabulary, grammar, and confidence through interactive lessons.\n\nThe app’s AI-powered voice recognition provides instant feedback on pronunciation and fluency. You can practice with daily challenges, chatbots, and real conversation scenarios.\n\nLangFlow turns learning into a habit — engaging, gamified, and rewarding. With every lesson, you move closer to speaking like a native.",
    "size": "76 MB",
    "reviews": "6.4K",
    "ratingAvg": 4.9,
    "downloads": "9.5M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 1400 },
      { "name": "5 star", "count": 4000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/SDfmVt8D/images-1.jpg",
    "title": "GameVerse: Your gateway to the gaming universe.",
    "companyName": "PlayHub • gameverse.io",
    "id": 18,
     "description": "GameVerse is your portal to a world of fun, competition, and discovery. Explore thousands of games — from indie masterpieces to AAA hits — all in one beautifully organized app.\n\nYou can track your achievements, connect with other players, and join live tournaments. The app also recommends games based on your preferences and playing style.\n\nWhether you’re a casual player or a hardcore gamer, GameVerse keeps your gaming life exciting, social, and up to date.",
    "size": "120 MB",
    "reviews": "8.9K",
    "ratingAvg": 4.2,
    "downloads": "10M",
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 1300 },
      { "name": "4 star", "count": 2300 },
      { "name": "5 star", "count": 3700 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/CDYwgPM/unnamed-1.png",
    "title": "Readify: Your personal reading assistant",
    "companyName": "BookZone • readify.io",
    "id": 19,
     "description": "Readify curates the best books, articles, and summaries tailored to your interests. Whether you want to learn new skills or relax with fiction, Readify makes reading simple and meaningful.\n\nIts smart recommendation engine helps you discover trending topics and must-read titles quickly. You can save highlights, take notes, and sync across all your devices.\n\nWith Readify, every page you read adds value — helping you grow intellectually and emotionally, one story at a time.",
    "size": "69 MB",
    "reviews": "5.2K",
    "ratingAvg": 4.7,
    "downloads": "6.4M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 600 },
      { "name": "4 star", "count": 1500 },
      { "name": "5 star", "count": 2500 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Tqq6jHb6/cat-and-dog-love-your-pet-day-banner-greeting-card-social-media-pink-background-photo.jpg",
    "title": "PetCare+: Because your pets deserve the best",
    "companyName": "HappyPaws • petcareplus.io",
    "id": 20,


        "description": "PetCare+ is the all-in-one app for pet lovers to manage their furry friends’ health and happiness. Track vaccinations, vet visits, feeding schedules, and grooming reminders all from one place.\n\nThe app includes expert articles on pet nutrition, training, and behavior tips. You can even connect with nearby vets or pet sitters for instant help.\n\nWith photo albums and daily care logs, PetCare+ turns pet parenting into a joyful, well-organized experience. Because your pets aren’t just animals — they’re family.",

    "size": "54 MB",
    "reviews": "3.1K",
    "ratingAvg": 4.6,
    "downloads": "2.2M",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 250 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 800 },
      { "name": "5 star", "count": 1450 }
    ]
  }




]
